#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.resources.module.eks.data.aws_partition.current: Reading...
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Reading...
module.resources.data.aws_caller_identity.current: Reading...
module.resources.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.data.aws_availability_zones.available: Reading...
module.resources.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/zeno-production-cluster/cluster]
module.resources.module.eks.data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f6151e1ec7ed4b96]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.data.aws_db_instance.zeno-db: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Reading...
module.resources.module.eks.aws_iam_role.this[0]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002]
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003]
module.resources.data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role.this[0]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001]
module.resources.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.data.aws_iam_session_context.current: Reading...
module.resources.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::084375562450:user/tarashish@developmentseed.org]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.resources.data.aws_db_instance.zeno-db: Read complete after 0s [id=zeno-db]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150083720000000d]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151500034600000008]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151459701100000006]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151500015800000007]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150038690000000b]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20241124151456720600000003-20241124151500094000000009]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150036100000000a]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=regular-eks-node-group-20241124151456720300000001-2024112415150080180000000c]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002-20241124151459683600000005]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002-20241124151459658300000004]
module.resources.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=8cd9f3d5-f6e1-49ff-a032-da1528c9daa4]
module.resources.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/zeno-production-cluster]
module.resources.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::084375562450:policy/zeno-production-cluster-cluster-ClusterEncryption20241124151527601700000013]
module.resources.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02f79d9422c79d174]
module.resources.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-01d72c016ec1365bf]
module.resources.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e06cd84685011ff8]
module.resources.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f703710ef8983d5a]
module.resources.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c9a24adf6985b148]
module.resources.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0e9ba580b832e58ab]
module.resources.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00564600fc0109d5f]
module.resources.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0dca056b5cb3f4bdc]
module.resources.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-01e99d583cc16bbd6]
module.resources.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b2d1b545f702eceb]
module.resources.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-060bb06a5c8393f81]
module.resources.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0aad369235ab19564]
module.resources.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0721a42d5f02f490a]
module.resources.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bd86b2d1d4c494db]
module.resources.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=zeno-production-cluster-cluster-20241124151456720400000002-20241124151528958300000014]
module.resources.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03cbd09508fae031c]
module.resources.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-006325e67577ba7cb]
module.resources.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0dbcf7c72bb07f949]
module.resources.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04e1927500c13e36f]
module.resources.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f703710ef8983d5a1080289494]
module.resources.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-334661475]
module.resources.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3638724160]
module.resources.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3648003083]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2982503749]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1125720652]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3210305847]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2598257535]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-4255533616]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-887369126]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-666374535]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1048699024]
module.resources.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0527a821acc8b2d5d]
module.resources.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05a8a28a38e5d35a9]
module.resources.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f01ab3ef8fb36172]
module.resources.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fe07f0eb9fb2161d]
module.resources.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0e06cd84685011ff81080289494]
module.resources.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=zeno-production-cluster]
module.resources.module.eks.time_sleep.this[0]: Refreshing state... [id=2024-11-24T15:26:39Z]
module.resources.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::084375562450:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/085DFD0C5701406346D03AB1EA5B38F2]
module.resources.helm_release.zeno-ingress-nginx: Refreshing state... [id=ingress-nginx]
module.resources.helm_release.zeno-cert-manager: Refreshing state... [id=cert-manager]
module.resources.module.eks.module.eks_managed_node_group["regular"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=6616271754968722364]
module.resources.module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8124355570844009309]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0fdd12ec7c2965609]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_launch_template.this[0]: Refreshing state... [id=lt-099de2edeeea863c8]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-production-cluster:regular-2024112415264607270000001b]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-production-cluster:default-20241124152646072500000019]
module.resources.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=zeno-production-cluster:aws-ebs-csi-driver]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.resources.module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
        id                            = "zeno-production-cluster"
        name                          = "zeno-production-cluster"
      ~ platform_version              = "eks.20" -> "eks.21"
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.resources.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.resources.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.resources.module.eks.aws_cloudwatch_log_group.this[0] must be replaced
+/- resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-east-1:084375562450:log-group:/aws/eks/zeno-production-cluster/cluster" -> (known after apply)
      ~ id                = "/aws/eks/zeno-production-cluster/cluster" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/eks/zeno-production-cluster/cluster" -> "/aws/eks/zeno-staging-cluster/cluster" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
          ~ "Name" = "/aws/eks/zeno-production-cluster/cluster" -> "/aws/eks/zeno-staging-cluster/cluster"
        }
      ~ tags_all          = {
          ~ "Name" = "/aws/eks/zeno-production-cluster/cluster" -> "/aws/eks/zeno-staging-cluster/cluster"
        }
        # (2 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] must be replaced
-/+ resource "aws_eks_addon" "this" {
      ~ arn                         = "arn:aws:eks:us-east-1:084375562450:addon/zeno-production-cluster/aws-ebs-csi-driver/22c9af65-086f-8e8a-463f-07f929aa54f7" -> (known after apply)
      ~ cluster_name                = "zeno-production-cluster" -> "zeno-staging-cluster" # forces replacement
      + configuration_values        = (known after apply)
      ~ created_at                  = "2024-11-24T15:28:41Z" -> (known after apply)
      ~ id                          = "zeno-production-cluster:aws-ebs-csi-driver" -> (known after apply)
      ~ modified_at                 = "2025-03-22T16:38:23Z" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.resources.module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                           = "arn:aws:eks:us-east-1:084375562450:cluster/zeno-production-cluster" -> (known after apply)
      ~ certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJUkNaSXRwS1ZZb1l3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRFeE1qUXhOVEUxTVRaYUZ3MHpOREV4TWpJeE5USXdNVFphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURyd3hFZ2pJTERkK1BSVmR0cy9FVWU1WXVMZVV2TlBxV1U4VDg0aGRYUWVDajdRdmxKYk5GRGYxM3AKNk1MZnhDTzBycmEzb05rV0htaXN3R1ZFUEpWREJTcG90VGxacGhvRHpKa0N4akNDc0F3TUxyNVV1T0R4UzZkUwpZOGYzSDhRVlBIRWRMakR0VlFJWVpTdkE5ZDFSUFBvVWhvcHdJYWFNNG1MTE1VUmlwUnEyNndZeVRXemFQWW9XCkdZV3doNC9QVldVcktNRkVEeGEzMGl5aDRwQi8rUWF5ejdkV2xyeDY4U0VZMjJIckN2MzUvSTFzWHFDZ3NTL2UKaGZHTW1iZUs4UFMyaytGUWhJQXZTTnRTZGt1a1lra2Y4d1dIUTRkaDdOaWpVU3QrUlNBUWd1eENhSUNqUWtxRwo5ckk1Q3J4Z1djbE41QVR2UnpuUHlHak9SaUxsQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRU01GVzBSR3IzQlJwNE5rM1JBVkN2dk44aDdUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQTZCV0dLSkNUYgp4MnFscTc0Tm5JL0w3aEt6MUVkWGdESnF0b1pXbTdCNmMvY055T0xJQUNmd21tOWVvRGJqMnpHVHc5OFhTVm84CkFEQmxTWHVSb2dTUi9RY2IxeEpVWnFVcHRXM2dNYWRvMjhZNnZVY0s0aG9lL3pPaDZDczlIMEdoVkxaNU9RaXgKVHYrSHRBM0ZlTWNuUFV6SWJUNXd1ZVVoUG41bnVVTkVwejAvaGNQL2JrM00rVWxMK1RNMnkwM0lmWEZhL21mLwpiV1kzK0RCUUhVa0svSlJ1T2hjRDhrUkdZV0RRMTQ5K2kxdlpSTE9BL2tlblFidXc1ZThNOFNiTmFQcXVsd2JVCjdLZjZ6dm50ZlhDa0R1Vkw0NGFWdWlXa2pnQWQrckZyaHFDd3BSRnRhMmtqdlNtQTRmaFI5SHF5L0wrRHZ0S2kKRTJDdVByU2w4TEVOCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2024-11-24T15:15:33Z" -> (known after apply)
      ~ endpoint                      = "https://085DFD0C5701406346D03AB1EA5B38F2.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "zeno-production-cluster" -> (known after apply)
      ~ identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/085DFD0C5701406346D03AB1EA5B38F2"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                          = "zeno-production-cluster" -> "zeno-staging-cluster" # forces replacement
      ~ platform_version              = "eks.21" -> (known after apply)
      ~ role_arn                      = "arn:aws:iam::084375562450:role/zeno-production-cluster-cluster-20241124151456720400000002" # forces replacement -> (known after apply) # forces replacement
      ~ status                        = "ACTIVE" -> (known after apply)
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
        # (4 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
          + service_ipv6_cidr = (known after apply)
            # (1 unchanged attribute hidden)

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0e489d72b61ec1d2e" -> (known after apply)
          ~ security_group_ids        = [
              - "sg-0bd86b2d1d4c494db",
            ] -> (known after apply)
          ~ vpc_id                    = "vpc-0f6151e1ec7ed4b96" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.resources.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::084375562450:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/085DFD0C5701406346D03AB1EA5B38F2" -> (known after apply)
      ~ id              = "arn:aws:iam::084375562450:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/085DFD0C5701406346D03AB1EA5B38F2" -> (known after apply)
      ~ tags            = {
          ~ "Name" = "zeno-production-cluster-eks-irsa" -> "zeno-staging-cluster-eks-irsa"
        }
      ~ tags_all        = {
          ~ "Name" = "zeno-production-cluster-eks-irsa" -> "zeno-staging-cluster-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.us-east-1.amazonaws.com/id/085DFD0C5701406346D03AB1EA5B38F2" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.resources.module.eks.aws_iam_policy.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_encryption" {
      ~ arn              = "arn:aws:iam::084375562450:policy/zeno-production-cluster-cluster-ClusterEncryption20241124151527601700000013" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::084375562450:policy/zeno-production-cluster-cluster-ClusterEncryption20241124151527601700000013" -> (known after apply)
      ~ name             = "zeno-production-cluster-cluster-ClusterEncryption20241124151527601700000013" -> (known after apply)
      ~ name_prefix      = "zeno-production-cluster-cluster-ClusterEncryption" -> "zeno-staging-cluster-cluster-ClusterEncryption" # forces replacement
      ~ policy_id        = "ANPARHJJM5DJBAVDHQOZA" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_iam_role.this[0] must be replaced
+/- resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::084375562450:role/zeno-production-cluster-cluster-20241124151456720400000002" -> (known after apply)
      ~ create_date           = "2024-11-24T15:14:58Z" -> (known after apply)
      ~ id                    = "zeno-production-cluster-cluster-20241124151456720400000002" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::084375562450:policy/zeno-production-cluster-cluster-ClusterEncryption20241124151527601700000013",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "zeno-production-cluster-cluster-20241124151456720400000002" -> (known after apply)
      ~ name_prefix           = "zeno-production-cluster-cluster-" -> "zeno-staging-cluster-cluster-" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROARHJJM5DJLHROOUMBV" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      ~ id         = "zeno-production-cluster-cluster-20241124151456720400000002-20241124151528958300000014" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::084375562450:policy/zeno-production-cluster-cluster-ClusterEncryption20241124151527601700000013" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "zeno-production-cluster-cluster-20241124151456720400000002" # forces replacement -> (known after apply) # forces replacement
    }

  # module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "zeno-production-cluster-cluster-20241124151456720400000002-20241124151459683600000005" -> (known after apply)
      ~ role       = "zeno-production-cluster-cluster-20241124151456720400000002" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "zeno-production-cluster-cluster-20241124151456720400000002-20241124151459658300000004" -> (known after apply)
      ~ role       = "zeno-production-cluster-cluster-20241124151456720400000002" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.resources.module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:us-east-1:084375562450:security-group/sg-0bd86b2d1d4c494db" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0bd86b2d1d4c494db" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01e99d583cc16bbd6",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "zeno-production-cluster-cluster-20241124151514397900000010" -> (known after apply)
      ~ name_prefix            = "zeno-production-cluster-cluster-" -> "zeno-staging-cluster-cluster-" # forces replacement
      ~ owner_id               = "084375562450" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "zeno-production-cluster-cluster" -> "zeno-staging-cluster-cluster"
        }
      ~ tags_all               = {
          ~ "Name" = "zeno-production-cluster-cluster" -> "zeno-staging-cluster-cluster"
        }
        # (3 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group.node[0] must be replaced
+/- resource "aws_security_group" "node" {
      ~ arn                    = "arn:aws:ec2:us-east-1:084375562450:security-group/sg-01e99d583cc16bbd6" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-01e99d583cc16bbd6" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0722c1b29c08baf08",
                ]
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 4443/tcp webhook"
              - from_port        = 4443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bd86b2d1d4c494db",
                ]
              - self             = false
              - to_port          = 4443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 6443/tcp webhook"
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bd86b2d1d4c494db",
                ]
              - self             = false
              - to_port          = 6443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 8443/tcp webhook"
              - from_port        = 8443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bd86b2d1d4c494db",
                ]
              - self             = false
              - to_port          = 8443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 9443/tcp webhook"
              - from_port        = 9443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bd86b2d1d4c494db",
                ]
              - self             = false
              - to_port          = 9443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bd86b2d1d4c494db",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bd86b2d1d4c494db",
                ]
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to RDS"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS UDP"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node ingress on ephemeral ports"
              - from_port        = 1025
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 65535
            },
        ] -> (known after apply)
      ~ name                   = "zeno-production-cluster-node-20241124151514429400000011" -> (known after apply)
      ~ name_prefix            = "zeno-production-cluster-node-" -> "zeno-staging-cluster-node-" # forces replacement
      ~ owner_id               = "084375562450" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                                          = "zeno-production-cluster-node" -> "zeno-staging-cluster-node"
          - "kubernetes.io/cluster/zeno-production-cluster" = "owned" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "owned"
        }
      ~ tags_all               = {
          ~ "Name"                                          = "zeno-production-cluster-node" -> "zeno-staging-cluster-node"
          - "kubernetes.io/cluster/zeno-production-cluster" = "owned" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "owned"
        }
        # (3 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] must be replaced
+/- resource "aws_security_group_rule" "cluster" {
      ~ id                       = "sgrule-334661475" -> (known after apply)
      ~ security_group_id        = "sg-0bd86b2d1d4c494db" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-077c6317fd13fd294" -> (known after apply)
      ~ source_security_group_id = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["egress_all"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3638724160" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0b7ba3c3750a2d301" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_443"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-2982503749" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0072b01bd821ccff9" -> (known after apply)
      ~ source_security_group_id = "sg-0bd86b2d1d4c494db" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-4255533616" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-04c38b4259acb9dd8" -> (known after apply)
      ~ source_security_group_id = "sg-0bd86b2d1d4c494db" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-887369126" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-02dd245b7e5994733" -> (known after apply)
      ~ source_security_group_id = "sg-0bd86b2d1d4c494db" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-666374535" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0db9463bfbacd3579" -> (known after apply)
      ~ source_security_group_id = "sg-0bd86b2d1d4c494db" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1125720652" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-064993144390ad6f9" -> (known after apply)
      ~ source_security_group_id = "sg-0bd86b2d1d4c494db" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3210305847" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0c0752ac8089880f1" -> (known after apply)
      ~ source_security_group_id = "sg-0bd86b2d1d4c494db" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3648003083" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0ece1a17f0c8a91ba" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1048699024" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-033e24265326cb0d2" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-2598257535" -> (known after apply)
      ~ security_group_id        = "sg-01e99d583cc16bbd6" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-095a9eedb908604cf" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2024-11-24T15:26:39Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJUkNaSXRwS1ZZb1l3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRFeE1qUXhOVEUxTVRaYUZ3MHpOREV4TWpJeE5USXdNVFphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURyd3hFZ2pJTERkK1BSVmR0cy9FVWU1WXVMZVV2TlBxV1U4VDg0aGRYUWVDajdRdmxKYk5GRGYxM3AKNk1MZnhDTzBycmEzb05rV0htaXN3R1ZFUEpWREJTcG90VGxacGhvRHpKa0N4akNDc0F3TUxyNVV1T0R4UzZkUwpZOGYzSDhRVlBIRWRMakR0VlFJWVpTdkE5ZDFSUFBvVWhvcHdJYWFNNG1MTE1VUmlwUnEyNndZeVRXemFQWW9XCkdZV3doNC9QVldVcktNRkVEeGEzMGl5aDRwQi8rUWF5ejdkV2xyeDY4U0VZMjJIckN2MzUvSTFzWHFDZ3NTL2UKaGZHTW1iZUs4UFMyaytGUWhJQXZTTnRTZGt1a1lra2Y4d1dIUTRkaDdOaWpVU3QrUlNBUWd1eENhSUNqUWtxRwo5ckk1Q3J4Z1djbE41QVR2UnpuUHlHak9SaUxsQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRU01GVzBSR3IzQlJwNE5rM1JBVkN2dk44aDdUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQTZCV0dLSkNUYgp4MnFscTc0Tm5JL0w3aEt6MUVkWGdESnF0b1pXbTdCNmMvY055T0xJQUNmd21tOWVvRGJqMnpHVHc5OFhTVm84CkFEQmxTWHVSb2dTUi9RY2IxeEpVWnFVcHRXM2dNYWRvMjhZNnZVY0s0aG9lL3pPaDZDczlIMEdoVkxaNU9RaXgKVHYrSHRBM0ZlTWNuUFV6SWJUNXd1ZVVoUG41bnVVTkVwejAvaGNQL2JrM00rVWxMK1RNMnkwM0lmWEZhL21mLwpiV1kzK0RCUUhVa0svSlJ1T2hjRDhrUkdZV0RRMTQ5K2kxdlpSTE9BL2tlblFidXc1ZThNOFNiTmFQcXVsd2JVCjdLZjZ6dm50ZlhDa0R1Vkw0NGFWdWlXa2pnQWQrckZyaHFDd3BSRnRhMmtqdlNtQTRmaFI5SHF5L0wrRHZ0S2kKRTJDdVByU2w4TEVOCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ "cluster_endpoint"                   = "https://085DFD0C5701406346D03AB1EA5B38F2.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
          ~ "cluster_name"                       = "zeno-production-cluster" -> "zeno-staging-cluster"
          ~ "cluster_service_cidr"               = "172.20.0.0/16" -> (known after apply)
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.resources.module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-01d72c016ec1365bf"
      ~ tags                   = {
          ~ "Name" = "vpc-zeno-production-default" -> "vpc-zeno-staging-default"
        }
      ~ tags_all               = {
          ~ "Name" = "vpc-zeno-production-default" -> "vpc-zeno-staging-default"
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.resources.module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0dca056b5cb3f4bdc"
      ~ tags                   = {
          ~ "Name" = "vpc-zeno-production-default" -> "vpc-zeno-staging-default"
        }
      ~ tags_all               = {
          ~ "Name" = "vpc-zeno-production-default" -> "vpc-zeno-staging-default"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.resources.module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-02f79d9422c79d174"
        name                   = "default"
      ~ tags                   = {
          ~ "Name" = "vpc-zeno-production-default" -> "vpc-zeno-staging-default"
        }
      ~ tags_all               = {
          ~ "Name" = "vpc-zeno-production-default" -> "vpc-zeno-staging-default"
        }
        # (7 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-04e1927500c13e36f"
      ~ tags                 = {
          ~ "Name" = "vpc-zeno-production-us-east-1a" -> "vpc-zeno-staging-us-east-1a"
        }
      ~ tags_all             = {
          ~ "Name" = "vpc-zeno-production-us-east-1a" -> "vpc-zeno-staging-us-east-1a"
        }
        # (12 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0721a42d5f02f490a"
      ~ tags     = {
          ~ "Name" = "vpc-zeno-production" -> "vpc-zeno-staging"
        }
      ~ tags_all = {
          ~ "Name" = "vpc-zeno-production" -> "vpc-zeno-staging"
        }
        # (3 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-0fe07f0eb9fb2161d"
      ~ tags                               = {
          ~ "Name" = "vpc-zeno-production-us-east-1a" -> "vpc-zeno-staging-us-east-1a"
        }
      ~ tags_all                           = {
          ~ "Name" = "vpc-zeno-production-us-east-1a" -> "vpc-zeno-staging-us-east-1a"
        }
        # (10 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e06cd84685011ff8"
      ~ tags             = {
          ~ "Name" = "vpc-zeno-production-private" -> "vpc-zeno-staging-private"
        }
      ~ tags_all         = {
          ~ "Name" = "vpc-zeno-production-private" -> "vpc-zeno-staging-private"
        }
        # (5 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0f703710ef8983d5a"
      ~ tags             = {
          ~ "Name" = "vpc-zeno-production-public" -> "vpc-zeno-staging-public"
        }
      ~ tags_all         = {
          ~ "Name" = "vpc-zeno-production-public" -> "vpc-zeno-staging-public"
        }
        # (5 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-00564600fc0109d5f"
      ~ tags                                           = {
          ~ "Name"                                          = "vpc-zeno-production-private-us-east-1a" -> "vpc-zeno-staging-private-us-east-1a"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            "kubernetes.io/role/internal-elb"               = "1"
        }
      ~ tags_all                                       = {
          ~ "Name"                                          = "vpc-zeno-production-private-us-east-1a" -> "vpc-zeno-staging-private-us-east-1a"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0c9a24adf6985b148"
      ~ tags                                           = {
          ~ "Name"                                          = "vpc-zeno-production-private-us-east-1b" -> "vpc-zeno-staging-private-us-east-1b"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            "kubernetes.io/role/internal-elb"               = "1"
        }
      ~ tags_all                                       = {
          ~ "Name"                                          = "vpc-zeno-production-private-us-east-1b" -> "vpc-zeno-staging-private-us-east-1b"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0e9ba580b832e58ab"
      ~ tags                                           = {
          ~ "Name"                                          = "vpc-zeno-production-private-us-east-1c" -> "vpc-zeno-staging-private-us-east-1c"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            "kubernetes.io/role/internal-elb"               = "1"
        }
      ~ tags_all                                       = {
          ~ "Name"                                          = "vpc-zeno-production-private-us-east-1c" -> "vpc-zeno-staging-private-us-east-1c"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0b2d1b545f702eceb"
      ~ tags                                           = {
          ~ "Name"                                          = "vpc-zeno-production-public-us-east-1a" -> "vpc-zeno-staging-public-us-east-1a"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            "kubernetes.io/role/elb"                        = "1"
        }
      ~ tags_all                                       = {
          ~ "Name"                                          = "vpc-zeno-production-public-us-east-1a" -> "vpc-zeno-staging-public-us-east-1a"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-060bb06a5c8393f81"
      ~ tags                                           = {
          ~ "Name"                                          = "vpc-zeno-production-public-us-east-1b" -> "vpc-zeno-staging-public-us-east-1b"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            "kubernetes.io/role/elb"                        = "1"
        }
      ~ tags_all                                       = {
          ~ "Name"                                          = "vpc-zeno-production-public-us-east-1b" -> "vpc-zeno-staging-public-us-east-1b"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0aad369235ab19564"
      ~ tags                                           = {
          ~ "Name"                                          = "vpc-zeno-production-public-us-east-1c" -> "vpc-zeno-staging-public-us-east-1c"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            "kubernetes.io/role/elb"                        = "1"
        }
      ~ tags_all                                       = {
          ~ "Name"                                          = "vpc-zeno-production-public-us-east-1c" -> "vpc-zeno-staging-public-us-east-1c"
          - "kubernetes.io/cluster/zeno-production-cluster" = "shared" -> null
          + "kubernetes.io/cluster/zeno-staging-cluster"    = "shared"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.resources.module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0f6151e1ec7ed4b96"
      ~ tags                                 = {
          ~ "Name" = "vpc-zeno-production" -> "vpc-zeno-staging"
        }
      ~ tags_all                             = {
          ~ "Name" = "vpc-zeno-production" -> "vpc-zeno-staging"
        }
        # (14 unchanged attributes hidden)
    }

  # module.resources.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-east-1:084375562450:nodegroup/zeno-production-cluster/default-20241124152646072500000019/02c9af64-288d-0382-1221-3ef1d3e95d2c" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "zeno-production-cluster" -> "zeno-staging-cluster" # forces replacement
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "zeno-production-cluster:default-20241124152646072500000019" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "default-20241124152646072500000019" -> (known after apply)
      ~ release_version        = "1.31.2-20241115" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-default-20241124152646072500000019-02c9af64-288d-0382-1221-3ef1d3e95d2c"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "default"
        }
        # (7 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0fdd12ec7c2965609"
          ~ name    = "default-20241124152643442800000015" -> (known after apply)
          ~ version = "2" -> (known after apply)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.resources.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-0fdd12ec7c2965609"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "default-20241124152643442800000015"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-01e99d583cc16bbd6",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.resources.module.eks.module.eks_managed_node_group["regular"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-east-1:084375562450:nodegroup/zeno-production-cluster/regular-2024112415264607270000001b/12c9af64-288c-45dc-a2cc-27f36a2c775c" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "zeno-production-cluster" -> "zeno-staging-cluster" # forces replacement
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "zeno-production-cluster:regular-2024112415264607270000001b" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "regular-2024112415264607270000001b" -> (known after apply)
      ~ release_version        = "1.31.2-20241115" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-regular-2024112415264607270000001b-12c9af64-288c-45dc-a2cc-27f36a2c775c"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "regular"
        }
        # (7 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-099de2edeeea863c8"
          ~ name    = "regular-20241124152643442900000017" -> (known after apply)
          ~ version = "2" -> (known after apply)
        }

      - node_repair_config {
          - enabled = true -> null
        }

      ~ scaling_config {
          ~ desired_size = 2 -> 1
            # (2 unchanged attributes hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.resources.module.eks.module.eks_managed_node_group["regular"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-099de2edeeea863c8"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "regular-20241124152643442900000017"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-01e99d583cc16bbd6",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.resources.module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::084375562450:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::084375562450:user/tarashish@developmentseed.org",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.resources.module.eks.module.kms.aws_kms_alias.this["cluster"] must be replaced
-/+ resource "aws_kms_alias" "this" {
      ~ arn            = "arn:aws:kms:us-east-1:084375562450:alias/eks/zeno-production-cluster" -> (known after apply)
      ~ id             = "alias/eks/zeno-production-cluster" -> (known after apply)
      ~ name           = "alias/eks/zeno-production-cluster" -> "alias/eks/zeno-staging-cluster" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-east-1:084375562450:key/8cd9f3d5-f6e1-49ff-a032-da1528c9daa4" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.resources.module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
      ~ description                        = "zeno-production-cluster cluster encryption key" -> "zeno-staging-cluster cluster encryption key"
        id                                 = "8cd9f3d5-f6e1-49ff-a032-da1528c9daa4"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::084375562450:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Default"
                    },
                  - {
                      - Action    = [
                          - "kms:Update*",
                          - "kms:UntagResource",
                          - "kms:TagResource",
                          - "kms:ScheduleKeyDeletion",
                          - "kms:Revoke*",
                          - "kms:ReplicateKey",
                          - "kms:Put*",
                          - "kms:List*",
                          - "kms:ImportKeyMaterial",
                          - "kms:Get*",
                          - "kms:Enable*",
                          - "kms:Disable*",
                          - "kms:Describe*",
                          - "kms:Delete*",
                          - "kms:Create*",
                          - "kms:CancelKeyDeletion",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::084375562450:user/tarashish@developmentseed.org"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyAdministration"
                    },
                  - {
                      - Action    = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::084375562450:role/zeno-production-cluster-cluster-20241124151456720400000002"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyUsage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 26 to add, 18 to change, 26 to destroy.

```

</details>

*Pusher: @batpad, Action: `pull_request`*